#include "s21_helpers.h"

typedef struct {
    int bits[4];
} decimal;

// bits[3]:
//  [31]      [30 - 24]         [23 - 16]             [15 - 0]
// ┌────┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐
// │знак│  не используется  │     МАСШТАБ   │      не используется      │
// └────┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┘

// bits[2] (32 бита): ───▶ СТАРШИЕ 32 бита мантиссы

// bits[1] (32 бита): ───▶ СРЕДНИЕ 32 бита мантиссы  

// bits[0] (32 бита): ───▶ МЛАДШИЕ 32 бита мантиссы


// ________________________________________________________________________________________________

// Пример

// Число: -12345 = -12345 × 10⁻²

// decimal.bits[0] = 12345;    // Младшие 32 бита: 00000000 00000000 00110000 00111001
// decimal.bits[1] = 0;        // Средние 32 бита: 00000000 00000000 00000000 00000000
// decimal.bits[2] = 0;        // Старшие 32 бита: 00000000 00000000 00000000 00000000

// Способ 1: Побитовые операции
// decimal.bits[3] = (1 << 31) | (2 << 16);  // Знак=1, масштаб=2

// bits[3] = 10000000 00000010 00000000  00000000
//           ↑        ↑        ↑        ↑
//           знак     масштаб  не исп.  не исп.
//           (1)      (2)      (0)      (0)



// Число: 0.001 = 1 × 10⁻³

// decimal.bits[0] = 1;        // Младшие 32 бита: 00000000 00000000 00000000 00000001
// decimal.bits[1] = 0;        // Средние 32 бита: 00000000 00000000 00000000 00000000
// decimal.bits[2] = 0;        // Старшие 32 бита: 00000000 00000000 00000000 00000000

// Способ 1: Побитовые операции
// decimal.bits[3] = (1 << 31) | (3 << 16);  // Знак=1, масштаб=3

// bits[3] = 10000000 00000011 00000000  00000000
//           ↑        ↑        ↑        ↑
//           знак     масштаб  не исп.  не исп.
//           (1)      (3)      (0)      (0)

